In [2]:
# Import necassary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
#Load dataset
inqueries = pd.read_csv('/Users/lukeblecha/neuefische-traum/datasets/inquiries_20210707.csv')

# Set time and date

In [11]:
inqueries['date'] = pd.to_datetime(inqueries['date'])
inqueries['time'] = pd.to_datetime(inqueries['time'])
inqueries['arrival_date'] = pd.to_datetime(inqueries['arrival_date'])
inqueries['departure_date'] = pd.to_datetime(inqueries['departure_date'])

## Look into data

In [12]:
inqueries.head(2)

,listing_id,title,date,time,adult_count,children_count,pets_count,arrival_date,departure_date,inquiry_price
0,c47741c3-2327-596e-89bc-5fcec81c9ee7,Anfrage,2019-01-01,2021-07-08 00:04:56,2.0,0.0,0.0,2019-06-30,2019-07-13,0.0
1,07ab2635-ca78-516a-bbfb-5d1dbf8b9a5a,Anfrage,2019-01-01,2021-07-08 00:05:36,6.0,2.0,0.0,2019-07-24,2019-07-31,1840.0

In [13]:
inqueries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4018005 entries, 0 to 4018004
Data columns (total 10 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      object
 1   title           object
 2   date            datetime64[ns]
 3   time            datetime64[ns]
 4   adult_count     float64
 5   children_count  float64
 6   pets_count      float64
 7   arrival_date    datetime64[ns]
 8   departure_date  datetime64[ns]
 9   inquiry_price   float64
dtypes: datetime64[ns](4), float64(4), object(2)
memory usage: 306.5+ MB

In [16]:
inqueries.describe().round(3)

       adult_count  children_count   pets_count  inquiry_price
count  4012271.000     4012271.000  4012271.000    3424008.000
mean         3.137           0.548        0.208        887.142
std          1.987           1.068        0.586       2301.717
min          0.000           0.000        0.000         -3.380
25%          2.000           0.000        0.000        382.000
50%          2.000           0.000        0.000        646.000
75%          4.000           1.000        0.000       1090.000
max         82.000          80.000      500.000    1792331.430

In [15]:
inqueries.isna().sum()

listing_id             0
title                  0
date                   0
time                   0
adult_count         5734
children_count      5734
pets_count          5734
arrival_date           0
departure_date         0
inquiry_price     593997
dtype: int64

In [17]:
inqueries.nunique()

listing_id        110746
title                  4
date                 731
time               82630
adult_count           52
children_count        33
pets_count            14
arrival_date        1344
departure_date      1352
inquiry_price      89049
dtype: int64

In [21]:
inqueries.title.unique()

array(['Anfrage', 'Direktbuchen', 'Externe Buchung',
       'Verbindliche Anfrage'], dtype=object)

In [26]:
inqueries['adult_count'].sort_values().max()

82.0